tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "gogorama/homebrew-95-chromium"


# GNU File, Shell, and Text utilities
brew "coreutils"
# Google Drive CLI Client
brew "gdrive"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Fast and simple video downloader
brew "lux"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Wrap web apps natively
brew "nativefier"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# User interface to the TELNET protocol
brew "telnet"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Additional completion definitions for zsh
brew "zsh-completions"

# Application uninstaller
cask "appcleaner"
# GUI app for Homebrew
cask "cakebrew"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Chromium v95 cask
cask "gogorama-chromium"
# App for testing HTTP/REST endpoints
cask "cocoarestclient"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Open-source video transcoder
cask "handbrake"
# Download manager
cask "jdownloader"
# File archiver
cask "keka"
# Trims video and audio files losslessly
cask "losslesscut"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Finder Toolbar app to open the current directory in Terminal
cask "openinterminal-lite"
# File system integration
cask "osxfuse"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Video editor
cask "shotcut"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Virtualizer for x86 hardware
cask "virtualbox"

mas "Bitwarden", id: 1352778147
mas "Fastest VPN", id: 1480208488
mas "Foscam VMS", id: 1521202507
mas "HP Smart", id: 1474276998
mas "MediaInfo", id: 510620098
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelstyle Photo Editor", id: 1244649277
mas "SerialTools", id: 611021963
mas "Twitter", id: 1482454543
